УТ_для_edt/src/InformationRegisters/сфпДанныеКоллтрекинга/сфпДанныеКоллтрекинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>сфпДанныеКоллтрекинга</name>
  <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
  <resources>
    <name>ДатаЗвонка</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Сайт</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>utm_campaign</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>utm_term</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>utm_source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>utm_medium</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>utm_content</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.CRM_Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>EnumRef.CRM_CallTrakingСценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_CallTrakingСценарии/CRM_CallTrakingСценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_CallTrakingСценарии</name>
  <enumValues>
    <name>Comagic</name>
  </enumValues>
  <enumValues>
    <name>ПочтовоеСообщение</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяОбработка</name>
  </enumValues>
  <enumValues>
    <name>Calltouch</name>
  </enumValues>
  <enumValues>
    <name>Callibri</name>
  </enumValues>
  <enumValues>
    <name>Roistat</name>
  </enumValues>
  <enumValues>
    <name>WebService</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийAPI</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
  <enumValues>
    <name>JivoSite</name>
  </enumValues>
  <enumValues>
    <name>UIS</name>
  </enumValues>
  <enumValues>
    <name>Mango</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/CRM_Заявка/CRM_Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_Заявка</name>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UTMМетка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <comment>0 - Заявка, 1 - Звонок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартБизнесРегион</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>смартКвалификация</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>CatalogRef.смартКвалификацииМенеджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСостояниеЛида</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>EnumRef.смартСостоянияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПродукт</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРезультатыПоискаПоКИ</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>смартБизнесРегионТекст</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартТипТовара</name>
    <comment>//++ #1845 смарт: Фролов 04.06.2024 //Замена Лидов на Заявки для первичной фиксации интересов.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартYclid_Метка</name>
    <comment>//++ #1941 смарт: Фролов 22.07.2024 //Добавить реквизит &quot;yclid&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартClientID</name>
    <comment>#1958 смарт: Лопато 05.08.2024 //Добавить реквизит &quot;ClientID&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/WebServices/softphoneCoMagic/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция PutCallInfo(LineName, CallerID, CallInfo)
	
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(CallInfo);
	json = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Если json.Свойство("comagic_context") И ЗначениеЗаполнено(CallerID) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Заявка = Документы.CRM_Заявка.СоздатьДокумент();
		
		СтруктураЗаполнения = Новый Структура;
		
		СтруктураЗаполнения.Вставить("Дата", 	  ТекущаяДата());
		Телефон = СокрЛП(json.ani);
		СтруктураЗаполнения.Вставить("Телефон",	  Телефон);
		
		СтруктураЗаполнения.Вставить("Тема",	  НСтр("ru='Заявка по клиенту';en='Request by customer'") + " " + Телефон);
		
		СтруктураЗаполнения.Вставить("ТипЗаявки", 1); // Звонок
		
		Ид = Формат(json.comagic_context.id, "ЧРД=; ЧРГ=; ЧГ=");
		СтруктураЗаполнения.Вставить("id",Ид);
		
		НаименованиеРеклКампания = СокрЛП(json.comagic_context.campaign);
		ИДРекламнаяКомпания 	 = Формат(json.comagic_context.campaign_id, "ЧРД=; ЧРГ=; ЧГ=");
		КаналПривлечения		 = СтрЗаменить(json.comagic_context.channel,Символы.НПП,"");
		ДанныеКампании = Новый Структура("Идентификатор,Наименование",ИДРекламнаяКомпания, НаименованиеРеклКампания);
		СтрРекл = CRM_СистемаСквознойАналитики.ПолучитьРекламнуюКампаниюПоИД(ДанныеКампании, КаналПривлечения);
		
		Если НЕ ЗначениеЗаполнено(СтрРекл.КаналПервичногоИнтереса) Тогда
			СтрРекл.КаналПервичногоИнтереса = ПланыВидовХарактеристик.КаналыРекламныхВоздействий.CRM_CoMagic;
		КонецЕсли;
			
		СтруктураЗаполнения.Вставить("КаналПервичногоИнтереса",СтрРекл.КаналПервичногоИнтереса);
		СтруктураЗаполнения.Вставить("ИсточникПервичногоИнтереса",СтрРекл.ИсточникПервичногоИнтереса);
		
		// Получим источник получения заявки
		ИсточникЗаявок = "";
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_ИсточникиПолученияЛидов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.CRM_ИсточникиПолученияЛидов КАК CRM_ИсточникиПолученияЛидов
		|ГДЕ
		|	CRM_ИсточникиПолученияЛидов.ИспользоватьГенераторЗвонка
		|	И НЕ CRM_ИсточникиПолученияЛидов.ПометкаУдаления
		|	И CRM_ИсточникиПолученияЛидов.Включено
		|	И CRM_ИсточникиПолученияЛидов.Сценарий В (&МассивОператоровКоллтрекинга)";
		МассивОператоров = Новый Массив;
		МассивОператоров.Добавить(Перечисления.CRM_CallTrakingСценарии.Comagic);
		МассивОператоров.Добавить(Перечисления.CRM_CallTrakingСценарии.UIS);
		Запрос.УстановитьПараметр("МассивОператоровКоллтрекинга", МассивОператоров);
		
		Результат = Запрос.Выполнить().Выбрать();
	
		Если Результат.Следующий() Тогда
			ИсточникЗаявок = Результат.Ссылка;
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("ИсточникПолучения", ИсточникЗаявок);
		
		СайтДомен = json.comagic_context.site;
		СайтДомен = СтрЗаменить(СайтДомен, "https://","");
		СайтДомен = СтрЗаменить(СайтДомен, "http://","");
		СайтИД	  = Формат(json.comagic_context.site_id, "ЧРД=; ЧРГ=; ЧГ=");
		СтруктураСайт = Новый Структура;
		СтруктураСайт.Вставить("id",СайтИД);
		СтруктураСайт.Вставить("Наименование",СайтДомен);
		СтруктураСайт.Вставить("domain",СайтДомен);
		Сайт = CRM_СистемаСквознойАналитики.ЗаписатьИнформациюПоСайтам(СтруктураСайт);
		СтруктураЗаполнения.Вставить("CRM_Сайт", Сайт);
		
		СтруктураЗаполнения.Вставить("CRM_UTM_source", json.comagic_context.utm_source);
		СтруктураЗаполнения.Вставить("CRM_UTM_medium", json.comagic_context.medium);
		СтруктураЗаполнения.Вставить("CRM_UTM_pos", "");

		device = json.comagic_context.device;
		Если НЕ ЗначениеЗаполнено(device) Тогда
			device = НСтр("ru='Прочее';en='Other'");
		КонецЕсли;
			
		ТекстОписание = "region: " + json.comagic_context.region + " 
						|login_page: "  + json.comagic_context.url + " 
						|visitor_device: "  + device + " 
						|visitor_id: " + json.comagic_context.visitor_id + " 
						|site: " + json.comagic_context.site + "
						|channel: "  + json.comagic_context.channel + " 
						|search_query: " + json.comagic_context.search_query + "
						|source: "  + json.comagic_context.utm_source;
			
		ЗаполнитьЗначенияСвойств(Заявка,СтруктураЗаполнения);
		Заявка.Комментарий = ТекстОписание;
		
		Документы.CRM_Заявка.ЗаполнитьКонтактЗаявки(Заявка);
		Справочники.CRM_ПравилаОбработкиОбращений.ПрименитьПравило(Заявка);
		Попытка
			Заявка.Записать();
			CRM_СистемаСквознойАналитики.
					УстановитьСсылкуВИсточникПервичногоИнтересаЗаписатьДопРеквизит(Заявка.Ссылка,СтруктураЗаполнения);
			
			Справочники.CRM_ПравилаОбработкиОбращений.ОбработатьОбращение(Заявка);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			ВызватьИсключение ОписаниеОшибки();
		КонецПопытки;
		
		МенеджерЗаписи = РегистрыСведений.сфпДанныеКоллтрекинга.СоздатьМенеджерЗаписи();
		НомерТелефона 							  = Прав(json.ani, 10);
		МенеджерЗаписи.НомерТелефона 			  = НомерТелефона;
		МенеджерЗаписи.ДатаЗвонка 				  = ТекущаяДата();
		МенеджерЗаписи.Идентификатор 			  = json.comagic_context.visitor_id;
		МенеджерЗаписи.Сайт 					  = json.comagic_context.site;
		МенеджерЗаписи.utm_campaign				  = СокрЛП(json.comagic_context.campaign);
		МенеджерЗаписи.utm_term		 			  = json.comagic_context.search_query;
		МенеджерЗаписи.Оператор 				  = Константы.сфпОператорКоллтрекинга.Получить();
		МенеджерЗаписи.Заявка 					  = Заявка.Ссылка;
		МенеджерЗаписи.КаналПервичногоИнтереса 	  = Заявка.КаналПервичногоИнтереса;
		МенеджерЗаписи.ИсточникПервичногоИнтереса = Заявка.ИсточникПервичногоИнтереса;
		МенеджерЗаписи.Записать();
		
		// Удалим записи старше 1 часа.
		Запрос = Новый Запрос("
		|ВЫБРАТЬ НомерТелефона
		|ИЗ РегистрСведений.сфпДанныеКоллтрекинга
		|ГДЕ ДатаЗвонка < &ДатаПроверки");
		Запрос.УстановитьПараметр("ДатаПроверки", (ТекущаяДата() - 3600));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.сфпДанныеКоллтрекинга.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.НомерТелефона = Выборка.НомерТелефона;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли;
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат "OK";

КонецФункции

#КонецОбласти
